Repository: yben27/emacslispref
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: fr_fr

source: Any argument whose name contains the name of a type (e.g., @var{integer}, @var{integer1} or @var{buffer}) is expected to be of that type. A plural of a type (such as @var{buffers}) often means a list of objects of that type. Arguments named @var{object} may be of any type. (@xref{Lisp Data Types}, for a list of Emacs object types.) Arguments with other sorts of names (e.g., @var{new-file}) are discussed specifically in the description of the function. In some sections, features common to the arguments of several functions are described at the beginning.
fr_fr: Tout argument dont le nom contient le nom d'un type (par exemple, @var{integer}, @var{integer1} ou @var{buffer}) est prévu pour être de ce type. Un pluriel d'un type (tel que @var{buffers}) signifie souvent une liste d'objets de ce type. Les arguments appelés @var{object} peuvent être de n'importe quel type. (@xref{Lisp Data Types}, pour une liste des types d'objet d'Emacs.) Des arguments avec d'autres sortes de noms (par exemple, @var{new-file}) sont discutés spécialement dans la description de la fonction. Dans quelques sections, des dispositifs communs aux arguments de plusieurs fonctions sont décrits du commencement.

source: Any other format character results in an @samp{Invalid format operation} error.
fr_fr: Tous les autres caractères de format provoquent une erreur @samp{Invalid format operation}.

source: Any two distinct Lisp objects are ``different'' as keys.
fr_fr: Deux objets Lisp distincts, quels qu'ils soient, sont ``différents'' en tant que clés.

source: Appendices
fr_fr: Annexes

source: Arithmetic Operations
fr_fr: Opérations arithmétiques

source: Array Functions
fr_fr: Fonctions pour les tableaux

source: Arrays
fr_fr: Tableaux

source: Arrays in Lisp, like arrays in most languages, are blocks of memory whose elements can be accessed in constant time. A @dfn{vector} is a general-purpose array of specified length; its elements can be any Lisp objects. (By contrast, a string can hold only characters as elements.) Vectors in Emacs are used for obarrays (vectors of symbols), and as part of keymaps (vectors of commands). They are also used internally as part of the representation of a byte-compiled function; if you print such a function, you will see a vector in it.
fr_fr: Les tableaux en Lisp, comme dans la majorité des langages, sont des blocs de mémoire dont les éléments ont tous le même temps d'accès. Un @dfn{vector} est un tableau universel d'une longueur donnée ; ses éléments peuvent être n'importe quel objet Lisp. (Par opposition, une chaîne de caractères peut seulement contenir des éléments de type caractère.) Dans Emacs, les vecteurs sont utilisés pour les obarrays (vecteurs de symboles), et comme partie de mappages claviers (vecteurs de commandes). Ils sont aussi utilisés en interne comme une partie de la représentation en octet de code ; si vous affichez une telle fonction, vous verrez un vecteur à l'intérieur.

source: As a special case, when @var{separators} is @code{nil} (or omitted), null strings are always omitted from the result. Thus:
fr_fr: Un cas particulier, quand @var{separators} est @code{nil} (ou non renseigné), les chaînes vides sont toujours omises du résultat. Par conséquent :

source: As far as the Lisp reader is concerned, @samp{()} and @samp{nil} are identical: they stand for the same object, the symbol @code{nil}. The different ways of writing the symbol are intended entirely for human readers. After the Lisp reader has read either @samp{()} or @samp{nil}, there is no way to determine which representation was actually written by the programmer.
fr_fr: En ce qui concerne le lecteur Lisp, @samp{()} et @samp{nil} sont identiques : ils représentent le même objet, le symbole @code{nil}. Les différentes manières d'écrire le symbole sont prévues entièrement pour les lecteurs humains. Après que le lecteur Lisp ait lu l'un ou l'autre, @samp{()} ou @samp{nil}, il n'y a aucune manière de déterminer quelle représentation a été écrite réellement par le programmeur.

source: As the example illustrates, shifting one place to the right divides the value of a positive integer by two, rounding downward.
fr_fr: Comme l'exemple le montre, le décalage d'une place vers la droite divise la valeur d'un nombre entier positif par deux, arrondissant vers le bas.

source: As the examples illustrate, shifting the pattern of bits one place to the left produces a number that is twice the value of the previous number.
fr_fr: Comme ces exemples le montrent, lorsqu'on décale la combinaison de chiffres binaires d'une place vers la gauche, on produit un nombre qui est le double de la valeur du précédent nombre.

source: As you use this manual, we ask that you mark pages with corrections so you can later look them up and send them to us. If you think of a simple, real-life example for a function or group of functions, please make an effort to write it up and send it in. Please reference any comments to the chapter name, section name, and function name, as appropriate, since page numbers and chapter and section numbers will change and we may have trouble finding the text you are talking about. Also state the number of the edition you are criticizing.
fr_fr: Quand vous employez ce manuel, nous vous demandons de marquer les pages avec les corrections ainsi vous pouvez plus tard les rechercher et nous les envoyer. Si vous pensez à un exemple simple et réel pour une fonction ou au groupe de fonctions, merci de faire l'effort de l'écrire et de l'envoyer. Veuillez mettre en référence tous les commentaires au nom de chapitre, nom de section, et le nom de fonction, comme approprié, puisque les numéros de page et les nombres de chapitre et de section changeront et nous aurions des problèmes pour trouver le texte dont vous parlez. Énoncer en outre le numéro de l'édition que vous critiquez.

source: As you use this manual, we ask that you send corrections as soon as you find them. If you think of a simple, real life example for a function or group of functions, please make an effort to write it up and send it in. Please reference any comments to the node name and function or variable name, as appropriate. Also state the number of the edition you are criticizing.
fr_fr: Quand vous vous servez de ce manuel, nous vous demandons d'envoyer les corrections dès que vous en trouverez. Si vous pensez à un exemple simple et réel pour une fonction ou au groupe de fonctions, merci de faire l'effort de l'écrire et de l'envoyer. Veuillez mettre en référence tous les commentaires du nom du nœud et la fonction ou le nom de la variable, comme approprié. Énoncer en outre le numéro de l'édition que vous critiquez.

source: At present, each integer value has a unique Lisp object in Emacs Lisp. Therefore, @code{eq} is equivalent to @code{=} where integers are concerned. It is sometimes convenient to use @code{eq} for comparing an unknown value with an integer, because @code{eq} does not report an error if the unknown value is not a number---it accepts arguments of any type. By contrast, @code{=} signals an error if the arguments are not numbers or markers. However, it is a good idea to use @code{=} if you can, even for comparing integers, just in case we change the representation of integers in a future Emacs version.
fr_fr: Actuellement, chaque valeur de nombre entier a un objet unique de Lisp dans Emacs Lisp. Par conséquent, @code{eq} est équivalent au @code{=} quand des nombres entiers sont concernés. Il est parfois commode d'employer @code{eq} pour comparer une valeur inconnue à un nombre entier, parce que @code{eq} ne rapporte pas d'erreur si la valeur inconnue n'est pas un nombre---il accepte des arguments de n'importe quel type---. En revanche, @code{=} signale une erreur si les arguments ne sont pas des nombres ou des marqueurs. Cependant, c'est une bonne idée d'employer @code{=} si vous le pouvez, même pour comparer des nombres entiers, juste au cas où nous changerions la représentation des nombres entiers dans une future version d'Emacs.

source: Basic properties of strings and characters.
fr_fr: Propriétés fondamentales des chaînes et des caractères.

source: Basics: String Basics
fr_fr: Notions de base sur les chaînes et les caractères

source: Because Emacs Lisp is designed for use in an editor, it has special features for scanning and parsing text as well as features for handling files, buffers, displays, subprocesses, and so on. Emacs Lisp is closely integrated with the editing facilities; thus, editing commands are functions that can also conveniently be called from Lisp programs, and parameters for customization are ordinary Lisp variables.
fr_fr: Puisque Emacs Lisp est conçu pour l'utilisation dans un éditeur, il dispose de caractéristiques spécifiques pour le balayage et l'analyse de texte aussi bien que des dispositifs pour manipuler des fichiers, des tampons, des affichages, des sous-processus, et ainsi de suite. Emacs Lisp est intégré avec de nombreuses fonctions d'édition ; ainsi, les commandes d'édition sont des fonctions qui peuvent également être commodément appelées par des programmes Lisp, et les paramètres de configuration sont des variables Lisp ordinaires.

source: Because the symbols used for abbrevs are not interned in the usual obarray, they will never appear as the result of reading a Lisp expression; in fact, normally they are never used except by the code that handles abbrevs. Therefore, it is safe to use them in an extremely nonstandard way. @xref{Creating Symbols}.
fr_fr: Puisque les symboles utilisés pour les abréviations ne sont pas compris dans la liste habituelle, ils n'apparaîtront jamais comme le résultat de lecture d'une expression Lisp ; en fait, normalement ils ne sont jamais utilisés excepté par le code qui traite ces abréviations. Par conséquent, il est prudent de les utiliser d'une manière extrêmement non-standard. @xref{Création de symboles}.

source: Because this symbol is the variable which holds the name of the file being visited in the current buffer, the value cell contents we see are the name of the source file of this chapter of the Emacs Lisp Manual. The property list cell contains the list @code{(variable-documentation 29529)} which tells the documentation functions where to find the documentation string for the variable @code{buffer-file-name} in the @file{DOC-@var{version}} file. (29529 is the offset from the beginning of the @file{DOC-@var{version}} file to where that documentation string begins---see @ref{Documentation Basics}.) The function cell contains the function for returning the name of the file. @code{buffer-file-name} names a primitive function, which has no read syntax and prints in hash notation (@pxref{Primitive Function Type}). A symbol naming a function written in Lisp would have a lambda expression (or a byte-code object) in this cell.
fr_fr: Comme le symbole est la variable qui contient le nom du fichier passé dans le tampon courant, les contenus de la cellule de valeur que l'on voit sont le nom du fichier source de ce chapitre du manuel Lisp Emacs. La cellule de liste de propriétés contient la liste @code{(variable-documentation 29529)} qui indique aux fonctions de documentation où trouver la chaîne de caractères de documentation pour la variable @code{buffer-file-name} dans le fichier @file{DOC-@var{version}}. (29529 est l'écart entre le début du fichier @file{DOC-@var{version}} et où la chaîne de caractères de documentation de la fonction commence --- voir @ref{Documentation Basics}.) La cellule de fonction contient la fonction qui va retourner le nom du fichier. @code{buffer-file-name} appelle une fonction primitive qui n'a pas de syntaxe de lecture et qui s'affiche en notation de hachage (@pxref{Primitive Function Type}). Un symbole appelant une fonction écrite en Lisp aurait une expression lambda (ou un objet octet-compilé) dans cette cellule.

source: Bitwise Operations
fr_fr: Opérations de bits

source: Bitwise Operations on Integers
fr_fr: Opérations de bits sur les entiers

source: Bool-Vectors
fr_fr: Vecteurs-booléens

source: Bool-vectors
fr_fr: Vecteurs-booléens

source: Buffer Text Notation
fr_fr: Notation des textes de tampon

source: But we recommend @code{copy-sequence} for this purpose (@pxref{Sequence Functions}).
fr_fr: Mais on recommande @code{copy-sequence} pour faire cela (voir la section @pxref{Fonctions sur les suites}).

source: By contrast, for an array of keyboard input characters (such as a key sequence), a vector may be necessary, because many keyboard input characters are outside the range that will fit in a string. @xref{Key Sequence Input}.
fr_fr: En revanche, pour un tableau de caractères d'entrée clavier (comme une séquence de clés), un vecteur peut être nécessaire car beaucoup de caractères d'entrée clavier sont en dehors de la plage de ceux qui peuvent rentrer dans un tableau de type string. @xref{Key Sequence Input}.

source: Case Conversion
fr_fr: Conversion de casse

source: Case Conversion in Lisp
fr_fr: Conversion de la casse en Lisp

source: Case Tables
fr_fr: Le tableau de casse

source: Case conversion functions.
fr_fr: Fonctions de conversion de casse.

source: Caveats
fr_fr: Avertissements

source: Certain format specifications require values of particular types. If you supply a value that doesn't fit the requirements, an error is signaled.
fr_fr: Certaines spécifications de format requièrent des valeurs de types particuliers. Si vous fournissez une valeur qui ne correspond pas aux exigences, une erreur est signalée.

source: Characteristics of arrays in Emacs Lisp.
fr_fr: Caractéristiques des tableaux en Emacs Lisp.

source: Characters are represented in Emacs Lisp as integers; whether an integer is a character or not is determined only by how it is used. Thus, strings really contain integers.
fr_fr: Les caractères sont représentés par des entiers dans Emacs Lisp ; un entier peut être un caractère ou pas, cela dépend seulement de la façon dont il est utilisé. Par conséquent, les chaînes de caractères sont vraiment constituées d’entiers.

source: Command, macro, and special form descriptions have the same format, but the word `Function' is replaced by `Command', `Macro', or `Special Form', respectively. Commands are simply functions that may be called interactively; macros process their arguments differently from functions (the arguments are not evaluated), but are presented the same way.
fr_fr: Commande, macro, et descriptions de formulaire spécial ont le même format, mais le mot `Function' est remplacé par `Command', `Macro', ou `Special Form', respectivement. Les commandes sont simplement des fonctions qui peuvent s'appeler interactivement; les macros traitent leurs arguments différemment des fonctions (les arguments ne sont pas évalués), mais sont présentés la même manière.

source: Comparing characters or strings.
fr_fr: Comparer des caractères ou des chaînes.

source: Comparison of Characters and Strings
fr_fr: Comparaison des caractères et des chaînes

source: Comparison of Numbers
fr_fr: Comparaison des nombres

source: Compilation makes programs run faster.
fr_fr: La compilation rend les programmes plus rapides.

source: Conditionals
fr_fr: Conditions

source: Conditionals, loops, nonlocal exits.
fr_fr: Conditions, boucles et sorties non locales.

source: Contrast this function with @code{buffer-substring} (@pxref{Buffer Contents}), which returns a string containing a portion of the text in the current buffer. The beginning of a string is at index 0, but the beginning of a buffer is at index 1.
fr_fr: Comparez cette fonction avec @code{buffer-substring} (voir la section @pxref{Examining Buffer Contents}), qui retourne une chaîne contenant une partie du texte de la mémoire tampon en cours. Le début d'une chaîne est à l'indice 0, mais le début d'une mémoire tampon est à l'indice 1.

source: Controlling expansion; expansion subroutines.
fr_fr: Contrôler l'expansion ; sous-programmes d'expansions.

source: Conversion of Characters and Strings
fr_fr: Conversion des caractères et des chaînes de caractères

source: Converting Lisp objects to text and back.
fr_fr: Convertir des objets Lisp en texte et inversement.

source: Converting float to integer and vice versa.
fr_fr: Convertir des nombres à virgule flottante en nombres entiers et vice-versa.

source: Converting to and from characters and strings.
fr_fr: Convertir en caractères et en chaînes et inversement.

source: Corrections were supplied by Karl Berry, Jim Blandy, Bard Bloom, Stephane Boucher, David Boyes, Alan Carroll, Richard Davis, Lawrence R. Dodd, Peter Doornbosch, David A. Duff, Chris Eich, Beverly Erlebacher, David Eckelkamp, Ralf Fassel, Eirik Fuller, Stephen Gildea, Bob Glickstein, Eric Hanchrow, George Hartzell, Nathan Hess, Masayuki Ida, Dan Jacobson, Jak Kirman, Bob Knighten, Frederick M. Korz, Joe Lammens, Glenn M. Lewis, K. Richard Magill, Brian Marick, Roland McGrath, Skip Montanaro, John Gardiner Myers, Thomas A. Peterson, Francesco Potorti, Friedrich Pukelsheim, Arnold D. Robbins, Raul Rockwell, Per Starb@"ack, Shinichirou Sugou, Kimmo Suominen, Edward Tharp, Bill Trost, Rickard Westman, Jean White, Matthew Wilding, Carl Witty, Dale Worley, Rusty Wright, and David D. Zuhn.
fr_fr: Les corrections ont été fournies par Karl Berry, Jim Blandy, Bard Bloom, Stephane Boucher, David Boyes, Alan Carroll, Richard Davis, Lawrence R. Dodd, Peter Doornbosch, David A. Duff, Chris Eich, Beverly Erlebacher, David Eckelkamp, Ralf Fassel, Eirik Fuller, Stephen Gildea, Bob Glickstein, Eric Hanchrow, George Hartzell, Nathan Hess, Masayuki Ida, Dan Jacobson, Jak Kirman, Bob Knighten, Frederick M. Korz, Joe Lammens, Glenn M. Lewis, K. Richard Magill, Brian Marick, Roland McGrath, Skip Montanaro, John Gardiner Myers, Thomas A. Peterson, Francesco Potorti, Friedrich Pukelsheim, Arnold D. Robbins, Raul Rockwell, Per Starbäck, Shinichirou Sugou, Kimmo Suominen, Edward Tharp, Bill Trost, Rickard Westman, Jean White, Matthew Wilding, Carl Witty, Dale Worley, Rusty Wright, et David D. Zuhn.

source: Creating Hash Tables
fr_fr: Création de tables de hachage

source: Creating Strings
fr_fr: Créer des chaînes

source: Creating Symbols
fr_fr: Créer des symboles

source: Creating and working with abbrev tables.
fr_fr: Créer et travailler avec des tables d'abréviations.

source: Customizing case conversion.
fr_fr: Personnalisation de la conversion de casse.

source: Data types of objects in Emacs Lisp.
fr_fr: Types de données des objets dans Emacs Lisp.

source: Defining Abbrevs
fr_fr: Définir des abréviations

source: Defining Hash Comparisons
fr_fr: Définition des comparaisons de hachage

source: Defining Symbols
fr_fr: Définir des symboles

source: Defining major and minor modes.
fr_fr: Définition de modes majeurs et mineurs.

source: Defining the bindings from keys to commands.
fr_fr: Définition de l'association des touches à des commandes.

source: Definition of mapatoms
fr_fr: Définition de mapatoms

source: Definition of sentence-end-double-space
fr_fr: Définition de sentence-end-double-space

source: Display
fr_fr: Affichage

source: Dozens of Lisp implementations have been built over the years, each with its own idiosyncrasies. Many of them were inspired by Maclisp, which was written in the 1960s at MIT's Project MAC. Eventually the implementors of the descendants of Maclisp came together and developed a standard for Lisp systems, called Common Lisp. In the meantime, Gerry Sussman and Guy Steele at MIT developed a simplified but very powerful dialect of Lisp, called Scheme.
fr_fr: Des douzaines de réalisations de Lisp ont été établies au cours des années, chacune avec ses propres particularités. Bon nombre d'entre elles ont été inspirées par Maclisp, qui a été écrit dans les années 60 au MIT's Project MAC. Par la suite les programmeurs des descendants de Maclisp se sont réunis et ont développé une norme pour des systèmes Lisp, appelée Common Lisp. En attendant, Gerry Sussman et Guy Steele au MIT ont développé un dialecte simplifié mais très puissant de Lisp, appelé Scheme.

source: Each char-table has a @dfn{subtype} which is a symbol. The subtype has two purposes: to distinguish char-tables meant for different uses, and to control the number of extra slots. For example, display tables are char-tables with @code{display-table} as the subtype, and syntax tables are char-tables with @code{syntax-table} as the subtype. A valid subtype must have a @code{char-table-extra-slots} property which is an integer between 0 and 10. This integer specifies the number of @dfn{extra slots} in the char-table.
fr_fr: Chaque char-table possède un sous-type (@dfn{subtype}) qui est un symbole. Le sous-type a deux buts : différencier les char-tables créées pour des usages différents et vérifier le nombre de cases supplémentaires. Par exemple, les tables d'affichage sont des char-tables avec @code{display-table} comme sous-type. Et les tables de syntaxe sont des char-tables avec @code{syntax-table} comme sous-type. Pour être valide, un sous-type doit avoir une propriété @code{char-table-extra-slots} qui soit un entier compris entre 0 et 10. Cet entier spécifie le nombre de cases supplémentaires (@dfn{extra slots} dans la char-table.

source: Each symbol has a property list
fr_fr: Chaque symbole a une liste de propriétés

source: Each symbol has four components (or ``cells''), each of which references another object:
fr_fr: Chaque symbole a quatre composants (ou ``cellules''), chacun référençant un autre objet :

source: Emacs Display
fr_fr: Affichage Emacs

source: Emacs Lisp is descended from Maclisp.
fr_fr: Emacs Lisp descend de Maclisp.

source: Emacs Lisp is not at all influenced by Scheme; but the GNU project has an implementation of Scheme, called Guile. We use Guile in all new GNU software that calls for extensibility.
fr_fr: Emacs Lisp n'est pas du tout influencé par Scheme; mais le projet GNU a une implémentation, appelée Guile. Nous employons Guile dans tout nouveau logiciel de GNU qui réclame l'extensibilité.

source: Emacs Lisp provides a general-purpose hash table data type, along with a series of functions for operating on them. Hash tables have no read syntax, and print in hash notation, like this:
fr_fr: Lisp Emacs fournit un type de données universel de table de hachage avec une série de fonctions pour les manipuler. Les tables de hachage n'ont pas de syntaxe de lecture, et l'affichage d'une notation de hachage est le suivant :

source: Emacs Lisp provides the traditional four arithmetic operations: addition, subtraction, multiplication, and division. Remainder and modulus functions supplement the division functions. The functions to add or subtract 1 are provided because they are traditional in Lisp and commonly used.
fr_fr: Emacs Lisp fournit les quatre opérations arithmétiques traditionnelles : addition, soustraction, multiplication et division. Les fonctions de reste et de modulo complètent les fonctions de division. Les fonctions additionner ou soustraire 1 sont fournies parce qu'elles sont traditionnelles en Lisp et utilisées généralement.

source: Emacs defines four types of array, all one-dimensional: @dfn{strings}, @dfn{vectors}, @dfn{bool-vectors} and @dfn{char-tables}. A vector is a general array; its elements can be any Lisp objects. A string is a specialized array; its elements must be characters. Each type of array has its own read syntax. @xref{String Type}, and @ref{Vector Type}.
fr_fr: Emacs définit quatre types de tableaux, tous à une dimension : @dfn{strings}, @dfn{vectors}, @dfn{bool-vectors} et @dfn{char-tables}. Un vecteur est un tableau général ; ses éléments peuvent être n'importe quels objets Lisp. Un tableau de type string est un tableau particulier ; ses éléments doivent être des caractères. Chaque type de tableau a sa propre syntaxe de lecture. @xref{String Type} et @ref{Vector Type}.
